Revit 2027 API
ParameterTypeId.BendingDetailTypeAngularDimensionOffset Property
 "Angular Dimension Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeAngularDimensionOffset { get; }
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionOffset {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeAngularDimensionOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace